# Loc (linhas, colunas) - Utilizados quando os indices são LABELS (Textos)

# Iloc (linhas, colunas) - Utilizados quando os índices são INTEIROS (Numeros)

In [1]:
import numpy as np
import pandas as pd

In [2]:
file ="ufo.csv"
ufo = pd.read_csv(file)
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### Método LOC

O método LOC é utilizado para selecionar linhas e colunas por sua label. Podemos passar os seguintes parâmetros:
    
    - Somente uma label
    - Uma lista de labels
    - Um slice de labels
    - Uma série booleana
    - Uma coluna (todas as labels)

In [3]:
# Trazendo a linha 0 e todas as colunas

ufo.loc[0, :]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [4]:
# Linhas 0, 1, 2 e todas as colunas

ufo.loc[[0,1,2], :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [5]:
# Intervalo INCLUSIVO entre 0 e 2 e todas as colunas

ufo.loc[0:2, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [6]:
# A omissão do parâmetro referente a coluna, traz todas as colunas por padrão. INCLUSIVO

ufo.loc[0:2]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [7]:
# Linhas 0 a 2, da coluna City. INCLUSIVO

ufo.loc[0:2, 'City']

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [8]:
# Linhas 0 a 2, colunas City e State

ufo.loc[0:2, ['City', 'State']]

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [9]:
# Podemos passar uma lista de labels de colunas

ufo [['City','State']].head(5)

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [10]:
# Podemos passar um intervalo de colunas. Nesse exemplo, das colunas City, até State

ufo.loc[0:2, 'City':'State']

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [11]:
# Trazendo a coluna State, nas linhas em que a cidade seja Oakland

ufo.loc[ufo.City=='Oakland', 'State']

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

In [12]:
#Podemos chegar ao mesmo resultado utilizando dot notation, como visto anteriormente, porém a utilização do LOC é preferida
# por questões de performance e boa prática

ufo[ufo.City=='Oakland'].State

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

# Vamos testar realmente as labels quando nossas linhas não tem índices inteiros

In [13]:
ufo_labels = ufo.set_index(['State'])

In [14]:
ufo_labels.head()

                       City Colors Reported Shape Reported             Time
State
NY                   Ithaca             NaN       TRIANGLE   6/1/1930 22:00
NJ              Willingboro             NaN          OTHER  6/30/1930 20:00
CO                  Holyoke             NaN           OVAL  2/15/1931 14:00
KS                  Abilene             NaN           DISK   6/1/1931 13:00
NY     New York Worlds Fair             NaN          LIGHT  4/18/1933 19:00

In [15]:
ufo_labels.loc['NY','Time'].head(10)

State
NY     6/1/1930 22:00
NY    4/18/1933 19:00
NY      1/8/1946 2:00
NY    2/20/1947 22:15
NY    7/14/1947 10:30
NY    8/12/1947 22:00
NY      8/1/1948 2:00
NY      1/2/1950 0:00
NY     6/30/1951 7:00
NY    2/10/1952 21:00
Name: Time, dtype: object

In [17]:
# Tentando realizar filtro com LOC e índices numericos

#ufo_labels.loc[0:10, 'Time']

# Método Iloc

### O método iloc também é utilizado para selecionar linhas e colunas, porém, diferente de loc onde passamos as labels, no ilocvem de indice location:

 - Um inteiro simples
 - Uma lista de inteiros
 - Um slice de inteiros
 - Uma coluna (igual a lista de todos os inteiros)

In [18]:
# linhas na posição 0 e 1, colunas na posição 0 e 3

ufo.iloc[[0, 1],[0, 3]]

          City State
0       Ithaca    NY
1  Willingboro    NJ

In [21]:
# Linhas: intervalo de 0 a 2 (exclusivo). Colunas: intervalo de 0 a 4 (exclusivo)

ufo.iloc[0:2, 0:4]

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ

In [22]:
# linhas de 0 a 4 e todas as colunas

ufo.iloc[0:4, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [23]:
ufo[0:4]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00